{
  "current_region_id": "town",
  "current_room_id": "town_square",
  "player": {
    "name": "Adventurer",
    "inventory": {
      "max_slots": 20,
      "max_weight": 100.0,
      "slots": [
        {
          "item": {
            "type": "Weapon",
            "obj_id": "item_starter_dagger",
            "name": "Rusty Dagger",
            "description": "A simple dagger with a rusty blade, but it's better than nothing.",
            "weight": 1.0,
            "value": 5,
            "stackable": false,
            "properties": {
              "damage": 3,
              "durability": 20,
              "max_durability": 20
            }
          },
          "quantity": 1
        },
        {
          "item": {
            "type": "Consumable",
            "obj_id": "item_healing_potion_small",
            "name": "Small Healing Potion",
            "description": "A small vial containing a red liquid that can heal minor wounds.",
            "weight": 0.5,
            "value": 10,
            "stackable": true,
            "properties": {
              "uses": 1,
              "max_uses": 1,
              "effect_value": 15,
              "effect_type": "heal"
            }
          },
          "quantity": 2
        },
        {
          "item": {
            "type": "Key",
            "obj_id": "item_tavern_cellar_key",
            "name": "Tavern Cellar Key",
            "description": "A small iron key that opens the cellar of the Drunken Dragon tavern.",
            "weight": 0.1,
            "value": 0,
            "stackable": false,
            "properties": {
              "target_id": "tavern_cellar_door"
            }
          },
          "quantity": 1
        },
        {
          "item": null,
          "quantity": 0
        }
      ]
    },
    "health": 100,
    "max_health": 100,
    "stats": {
      "strength": 10,
      "dexterity": 10,
      "intelligence": 10
    },
    "level": 1,
    "experience": 0,
    "experience_to_level": 100,
    "skills": {
      "swordsmanship": 1
    },
    "effects": [],
    "quest_log": {
      "missing_supplies": "started"
    }
  },
  "npcs": {
    "npc_tavern_keeper": {
      "obj_id": "npc_tavern_keeper",
      "name": "Barlin the Tavern Keeper",
      "description": "A robust man with a thick beard and friendly eyes. He keeps his tavern in good order and knows all the local gossip.",
      "health": 100,
      "max_health": 100,
      "friendly": true,
      "inventory": {
        "max_slots": 10,
        "max_weight": 50.0,
        "slots": [
          {
            "item": {
              "type": "Consumable",
              "obj_id": "item_ale",
              "name": "Tankard of Ale",
              "description": "A foaming tankard of locally brewed ale. It smells of hops and barley.",
              "weight": 1.0,
              "value": 2,
              "stackable": true,
              "properties": {
                "uses": 1,
                "max_uses": 1,
                "effect_value": 2,
                "effect_type": "heal"
              }
            },
            "quantity": 10
          }
        ]
      },
      "current_region_id": "town",
      "current_room_id": "tavern",
      "home_region_id": "town",
      "home_room_id": "tavern",
      "behavior_type": "stationary",
      "patrol_points": [],
      "patrol_index": 0,
      "follow_target": null,
      "wander_chance": 0.3,
      "schedule": {},
      "move_cooldown": 10,
      "dialog": {
        "greeting": "Welcome to the Drunken Dragon! Can I get you a drink or a hot meal?",
        "drink": "I've got ale, mead, and wine. The ale's brewed right here in town.",
        "food": "Our cook makes a mean venison stew, and the bread's fresh from the baker this morning.",
        "rumors": "Have you heard about the missing supplies? The last merchant caravan lost an entire wagon's worth of goods. Some say it was bandits, others blame forest creatures.",
        "town": "Riverside's a peaceful place, most of the time. We get travelers passing through on their way upriver to the city.",
        "forest": "I wouldn't venture too deep into those woods alone. Strange things happen there, especially at night.",
        "cellar_key": "Ah, the cellar key! Found it, did you? Must have dropped it somewhere. You can keep it, might be useful if you need to... access the cellar quickly.",
        "portbridge": "Portbridge, down by the sea? Rough place, full of sailors and smugglers, or so I hear. Very different from our quiet village."
      },
      "default_dialog": "The {name} is busy wiping down the bar."
    },
    "npc_blacksmith": {
      "obj_id": "npc_blacksmith",
      "name": "Grenda the Blacksmith",
      "description": "A tall, muscular woman with her hair tied back and soot-stained arms. Her steady hands and keen eye produce some of the finest metalwork in the region.",
      "health": 120,
      "max_health": 120,
      "friendly": true,
      "inventory": {
        "max_slots": 10,
        "max_weight": 50.0,
        "slots": []
      },
      "current_region_id": "town",
      "current_room_id": "blacksmith",
      "home_region_id": "town",
      "home_room_id": "blacksmith",
      "behavior_type": "stationary",
      "patrol_points": [],
      "patrol_index": 0,
      "follow_target": null,
      "wander_chance": 0.3,
      "schedule": {},
      "move_cooldown": 10,
      "dialog": {
        "greeting": "Welcome to my forge. Need something repaired or looking to buy?",
        "weapons": "I can make you a fine sword or axe if you've got the coin. Quality steel, properly tempered.",
        "armor": "I've got leather and chainmail available. Full plate's a special order, takes time to get right.",
        "repair": "I can fix that up for you. Just leave it with me and come back tomorrow.",
        "business": "Business is steady enough. Always need for good tools and weapons.",
        "missing_supplies": "Aye, there was good steel on that caravan. I was expecting a shipment that never arrived.",
        "mountains": "The Frostpeaks? Cold and dangerous up there. Heard tell of old mines, but most are played out or collapsed. Not worth the climb unless you're hunting griffins... or trouble."
      },
      "default_dialog": "The {name} nods but continues working at the forge."
    },
    "npc_village_elder": {
      "obj_id": "npc_village_elder",
      "name": "Elder Thorne",
      "description": "An elderly person with silver hair and a dignified bearing. Despite their age, there's a sharp intelligence in their eyes and a commanding presence in their manner.",
      "health": 70,
      "max_health": 70,
      "friendly": true,
      "inventory": {
        "max_slots": 10,
        "max_weight": 50.0,
        "slots": []
      },
      "current_region_id": "town",
      "current_room_id": "town_square",
      "home_region_id": "town",
      "home_room_id": "town_square",
      "behavior_type": "scheduled",
      "patrol_points": [],
      "patrol_index": 0,
      "follow_target": null,
      "wander_chance": 0.3,
      "schedule": {
        "8": "town_square",
        "12": "tavern",
        "14": "town_square",
        "20": "tavern_rooms"
      },
      "move_cooldown": 10,
      "dialog": {
        "greeting": "Greetings, traveler. What brings you to our humble village?",
        "village": "Riverside has stood here for five generations. We're simple folk, making our living from the river and the land.",
        "history": "Our village was founded by refugees from the great war to the north. They sought peace, and found it here by the river.",
        "missing_supplies": "Yes, it's quite troubling. A whole wagon of supplies vanished between here and the crossroads. We need those supplies for winter. If you could investigate, the village would be most grateful. Any clue, no matter how small, could help.",
        "reward": "Find our missing supplies, and you'll be well compensated. The merchants' guild has offered a bounty, and I can add a personal reward as well.",
        "forest": "The Whispering Woods have always held secrets. Our ancestors knew to respect its boundaries. Some say there are ancient ruins deep within.",
        "ruins": "The ruins in the forest? Aye, they are spoken of in whispers. Older than memory. Best left undisturbed, some say. Too many shadows linger there.",
        "swamp": "The Murkwater? A foul place. Little of value there, and much that can harm you. Best avoided.",
        "farmland": "The farms across the river provide much of our sustenance. Good, honest folk work that land.",
        "portbridge": "I have little dealing with Portbridge. It's a place of transient folk and shifting loyalties, unlike our steadfast community here."
      },
      "default_dialog": "The {name} considers your words carefully before responding."
    },
    "npc_merchant": {
      "obj_id": "npc_merchant",
      "name": "Talia the Merchant",
      "description": "A well-dressed woman with a quick smile and shrewd eyes. She travels between villages with her wagon of goods, bringing news as well as merchandise.",
      "health": 80,
      "max_health": 80,
      "friendly": true,
      "inventory": {
        "max_slots": 10,
        "max_weight": 50.0,
        "slots": []
      },
      "current_region_id": "town",
      "current_room_id": "market",
      "home_region_id": "town",
      "home_room_id": "market",
      "behavior_type": "wanderer",
      "patrol_points": [],
      "patrol_index": 0,
      "follow_target": null,
      "wander_chance": 0.4,
      "schedule": {},
      "move_cooldown": 10,
      "dialog": {
        "greeting": "Well met! Looking to buy or sell? I've got wares from up and down the river.",
        "goods": "I've got cloth from the city, spices from the eastern lands, tools, trinkets, and more. Take a look!",
        "buy": "Show me what you're selling, and I'll give you a fair price.",
        "news": "News from the city? The new tax on river trade has everyone in an uproar. The merchants' guild is petitioning the king.",
        "bandits": "There's been more bandit activity on the north road. I hired guards for this trip, cost me a pretty coin.",
        "missing_supplies": "I heard about that. Bad business, that. Makes all of us merchants nervous. Who's to say our goods won't be next?",
        "travel": "I travel the river road mostly. Safer than the deep woods, usually. Though I've heard odd tales about the swamp downstream... nothing I'd care to investigate myself.",
        "portbridge": "Portbridge? Oh yes, I trade there sometimes, though you have to watch your back. Good place to find exotic goods brought in by sea, if you know where to look. The coastal path south from the swamp will get you there, eventually."
      },
      "default_dialog": "The {name} is busy arranging her wares."
    },
    "npc_forest_hermit": {
      "obj_id": "npc_forest_hermit",
      "name": "Old Bryn",
      "description": "A hunched figure in tattered clothes with a wild beard and hair. Despite his unkempt appearance, his eyes are clear and knowing.",
      "health": 60,
      "max_health": 60,
      "friendly": true,
      "inventory": {
        "max_slots": 10,
        "max_weight": 50.0,
        "slots": []
      },
      "current_region_id": "forest",
      "current_room_id": "ancient_tree",
      "home_region_id": "forest",
      "home_room_id": "ancient_tree",
      "behavior_type": "wanderer",
      "patrol_points": [],
      "patrol_index": 0,
      "follow_target": null,
      "wander_chance": 0.2,
      "schedule": {},
      "move_cooldown": 10,
      "dialog": {
        "greeting": "Eh? Who's there? Don't get many visitors out this way.",
        "forest": "These woods have a spirit to them, if you know how to listen. Been living here for twenty years, and they still surprise me.",
        "village": "Bah, too many people in that village. Too much noise. I prefer the company of trees.",
        "missing_supplies": "Supplies? Hrmph. Saw something strange a few nights back. Lights moving through the trees, deeper in than most dare to go. Towards the old stones... Not natural, those lights.",
        "cave": "There's caves in the hills yonder. Old caves, deep ones. Folk say they're haunted, but it's just echoes playing tricks. Still, wouldn't go too deep if I were you. Lead all sorts of places... some up to the cold peaks.",
        "ruins": "The old ruins? Aye, they're real enough. Hidden in the deepest part of the woods, northwest of here. Built by who? Not men, I'd wager. The stones are too perfectly fit, and the markings... not like any writing I've seen."
      },
      "default_dialog": "The {name} mutters to himself and doesn't seem to hear you."
    }
  }
}
